[Killed] Block
Sites/noriste/typescript-is-type/index.js:8:22
    * @param {*} instance The instance to be checked
    * @param {string|string[]} keys The keys that must be defined while checking the instance type
    */
-  is(instance, keys) {
-    if (instance === undefined || instance === null) {
-      return false;
-    }
-    if(!Array.isArray(keys)) {
-      keys = [keys];
-    }
-
-    for(let i = 0, n = keys.length; i < n; i++) {
-      if(instance[keys[i]] === undefined) {
-        return false;
-      }
-    }
-    return true;
-  }
+  is(instance, keys) {}
 }
 

[Killed] BinaryExpression
Sites/noriste/typescript-is-type/index.js:9:9
    * @param {string|string[]} keys The keys that must be defined while checking the instance type
    */
   is(instance, keys) {
-    if (instance === undefined || instance === null) {
+    if (instance === undefined && instance === null) {
       return false;
     }

[Killed] Block
Sites/noriste/typescript-is-type/index.js:9:54
    * @param {string|string[]} keys The keys that must be defined while checking the instance type
    */
   is(instance, keys) {
-    if (instance === undefined || instance === null) {
-      return false;
-    }
+    if (instance === undefined || instance === null) {}
     if(!Array.isArray(keys)) {
       keys = [keys];

[Killed] BooleanSubstitution
Sites/noriste/typescript-is-type/index.js:10:14
    */
   is(instance, keys) {
     if (instance === undefined || instance === null) {
-      return false;
+      return true;
     }
     if(!Array.isArray(keys)) {

[Killed] IfStatement
Sites/noriste/typescript-is-type/index.js:12:8
     if (instance === undefined || instance === null) {
       return false;
     }
-    if(!Array.isArray(keys)) {
+    if(true) {
       keys = [keys];
     }

[Killed] IfStatement
Sites/noriste/typescript-is-type/index.js:12:8
     if (instance === undefined || instance === null) {
       return false;
     }
-    if(!Array.isArray(keys)) {
+    if(false) {
       keys = [keys];
     }

[Killed] ArrayLiteral
Sites/noriste/typescript-is-type/index.js:13:14
       return false;
     }
     if(!Array.isArray(keys)) {
-      keys = [keys];
+      keys = [];
     }
 

[Killed] Block
Sites/noriste/typescript-is-type/index.js:16:49
       keys = [keys];
     }
 
-    for(let i = 0, n = keys.length; i < n; i++) {
-      if(instance[keys[i]] === undefined) {
-        return false;
-      }
-    }
+    for(let i = 0, n = keys.length; i < n; i++) {}
     return true;
   }

[Killed] PostfixUnaryExpression
Sites/noriste/typescript-is-type/index.js:16:44
       keys = [keys];
     }
 
-    for(let i = 0, n = keys.length; i < n; i++) {
+    for(let i = 0, n = keys.length; i < n; i--) {
       if(instance[keys[i]] === undefined) {
         return false;

[Killed] IfStatement
Sites/noriste/typescript-is-type/index.js:17:10
     }
 
     for(let i = 0, n = keys.length; i < n; i++) {
-      if(instance[keys[i]] === undefined) {
+      if(true) {
         return false;
       }

[Killed] Block
Sites/noriste/typescript-is-type/index.js:17:43
     }
 
     for(let i = 0, n = keys.length; i < n; i++) {
-      if(instance[keys[i]] === undefined) {
-        return false;
-      }
+      if(instance[keys[i]] === undefined) {}
     }
     return true;

[Killed] BooleanSubstitution
Sites/noriste/typescript-is-type/index.js:18:16
 
     for(let i = 0, n = keys.length; i < n; i++) {
       if(instance[keys[i]] === undefined) {
-        return false;
+        return true;
       }
     }
